Revit 2027 API
FabricSheet.HostId Property
 The structure element that contains the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostId { get; }
Public ReadOnly Property HostId As ElementId
	Get
public:
property ElementId^ HostId {
	ElementId^ get ();
}
member HostId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace